<?php
return [
    'custom' => [
    'username' => [
        'required' => 'نام کاربری الزامی است.',
        'string' => 'نام کاربری باید به صورت رشته باشد.',
        'max' => 'نام کاربری نباید بیشتر از ۲۵۵ کاراکتر باشد.',
        'unique' => 'این نام کاربری قبلاً در سیستم ثبت شده است.',

    ],
    'email' => [
        'required' => 'ایمیل الزامی است.',
        'string' => 'ایمیل باید به صورت رشته باشد.',
        'email' => 'ایمیل باید یک آدرس ایمیل معتبر باشد.',
        'max' => 'ایمیل نباید بیشتر از ۲۵۵ کاراکتر باشد.',
        'unique' => 'این ایمیل قبلاً در سیستم ثبت شده است.',
    ],
    'password' => [
        'required' => 'رمز عبور الزامی است.',
        'string' => 'رمز عبور باید به صورت رشته باشد.',
        'min' => 'رمز عبور نباید کمتر از ۸ کاراکتر باشد.',
        'nullable' => 'رمز عبور الزامی نیست.',
    ],
    'login' => [
        'required' => 'ایمیل الزامی است.',
        'string' => 'ایمیل باید به صورت رشته باشد.',
    ]
],
];